In [6]:
import pandas as pd

In [7]:
df = pd.read_table('https://github.com/prasertcbs/tutorial/raw/master/employee.tsv')
df.head()

  gender        dob  occupation  work_exp    salary  own_house  children
0      M  31-Jul-89       nurse       2.2  223700.0       True         1
1    NaN  30-Oct-92     dentist       6.7  121100.0       True         1
2      F        NaN  accountant       9.0       NaN      False         2
3      F  17-Sep-87    engineer       1.7   79900.0      False         0
4      M  24-Jan-93     teacher       3.6   32800.0      False         2

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
gender        9 non-null object
dob           8 non-null object
occupation    10 non-null object
work_exp      10 non-null float64
salary        8 non-null float64
own_house     10 non-null bool
children      10 non-null int64
dtypes: bool(1), float64(2), int64(1), object(3)
memory usage: 570.0+ bytes

In [11]:
df = pd.read_table('https://github.com/prasertcbs/tutorial/raw/master/employee.tsv', parse_dates = ['dob'])
df.head()

  gender        dob  occupation  work_exp    salary  own_house  children
0      M 1989-07-31       nurse       2.2  223700.0       True         1
1    NaN 1992-10-30     dentist       6.7  121100.0       True         1
2      F        NaT  accountant       9.0       NaN      False         2
3      F 1987-09-17    engineer       1.7   79900.0      False         0
4      M 1993-01-24     teacher       3.6   32800.0      False         2

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
gender        9 non-null object
dob           8 non-null datetime64[ns]
occupation    10 non-null object
work_exp      10 non-null float64
salary        8 non-null float64
own_house     10 non-null bool
children      10 non-null int64
dtypes: bool(1), datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 570.0+ bytes

In [13]:
df.occupation.str.title()

0         Nurse
1       Dentist
2    Accountant
3      Engineer
4       Teacher
5     Developer
6         Nurse
7        Lawyer
8       Teacher
9        Police
Name: occupation, dtype: object

In [22]:
pd.to_datetime('today').year - df.dob.dt.year

0    29.0
1    26.0
2     NaN
3    31.0
4    25.0
5     NaN
6    24.0
7    27.0
8    24.0
9    31.0
Name: dob, dtype: float64

In [27]:
df['age'] = pd.to_datetime('today').year - df['dob'].dt.year
df

  gender        dob  occupation  work_exp    salary  own_house  children   age
0      M 1989-07-31       nurse       2.2  223700.0       True         1  29.0
1    NaN 1992-10-30     dentist       6.7  121100.0       True         1  26.0
2      F        NaT  accountant       9.0       NaN      False         2   NaN
3      F 1987-09-17    engineer       1.7   79900.0      False         0  31.0
4      M 1993-01-24     teacher       3.6   32800.0      False         2  25.0
5      F        NaT   developer       1.8       NaN       True         1   NaN
6      F 1994-09-26       nurse       5.6  272500.0      False         1  24.0
7      M 1991-05-07      lawyer       4.1   41600.0      False         0  27.0
8      M 1994-12-04     teacher       3.3  141300.0       True         0  24.0
9      M 1987-07-10      police       6.5   68000.0       True         1  31.0

In [30]:
df.dob.dt.weekday_name

0      Monday
1      Friday
2         NaN
3    Thursday
4      Sunday
5         NaN
6      Monday
7     Tuesday
8      Sunday
9      Friday
Name: dob, dtype: object

In [28]:
df.own_house.value_counts()

True     5
False    5
Name: own_house, dtype: int64